CodeIgniterFinal/app/Models/UsersModel.php

SELECT *
FROM `users`
WHERE `username` = 'admin'
---
    public function checkUser($user, $pass) // array[bool|object|string|null
    {
        // Obtener usuario y password SOLAMENTE SIN HASEAR LA CONTRASEÑA (La password escrita sin encriptar)
        // return $this->where(['username' => $user, 'password' => $pass])->find();

        $sql = $this->where(['username' => $user])->find();