CodeIgniterFinal/app/Controllers/FactsController.php

SELECT *
FROM `facts`
JOIN `7wonders` ON `7wonders`.`id`=`facts`.`wonder_id`
---
    public function index() {


        $facts_model = model(FactsModel::class);
        $wonders_model = model(WondersModel::class);

        // AQUÍ HAY UN JOIN DE EJEMPLO

        $data = [
            'facts' => $facts_model->join('7wonders', '7wonders.id=facts.wonder_id')->findAll(),
            'title' => 'Manage Facts',
        ];

SELECT *
FROM `facts`
WHERE `fact_id` = '16'
 LIMIT 1
---
    public function updateForm($id) {

        $session = session();
        if(empty($session->get('user'))){
            return redirect()->to(base_url('admin/loginForm'));
        }
        helper('form');

        $facts_model = model(FactsModel::class);
        $wonders_model = model(WondersModel::class);

        // Para rellenar el desplegable
        $data['wonders'] = $wonders_model->findAll();

        // Para rellenar campos del formulario de fact a modificar
        $data['fact'] = $facts_model->where(['fact_id' => $id])->first();

UPDATE `facts` SET `fact_text` = 'A ERA UNA MURALLA MUY GRANDE PARA PROTEGERSE DE LOS MONGOLOS', `wonder_id` = '6'
WHERE `facts`.`fact_id` IN ('16')
---
    public function updateFact($id)
    {
        helper('form');


        $data = $this->request->getPost(['fact_text', 'wonder_id', ]);

        // Checks whether the submitted data passed the validation rules.
        if (! $this->validateData($data, [
            'fact_text' => 'required|max_length[255]|min_length[3]',
            'wonder_id' => 'required',
        ])) {
            // The validation fails, so returns the form.
            return $this->updateForm($id);
        }

        // Gets the validated data.
        $post = $this->validator->getValidated();

        $facts_model = model(FactsModel::class);


        $facts_model->save([
            'fact_id' => $id,
            'fact_text' => $post['fact_text'],
            'wonder_id'  => $post['wonder_id'],
        ]);