CodeIgniterFinal/app/Controllers/Libros.php

SELECT *
FROM `libros`
---
    public function index($location) {

        $libros_model = model(LibrosModel::class);

        $data = [
            'libros' => $libros_model->findAll(),
            'title' => 'Libros relacionados con las maravillas',
        ];

SELECT *
FROM `libros`
SELECT *
FROM `libros`
WHERE `id_libro` = '1'
 LIMIT 1
---
    public function show($location, $id_libro) {


        $libros_model = model(LibrosModel::class);

        $data['libros'] = $libros_model->findAll();


        $data['libro_selected'] = $libros_model->where(['id_libro' => $id_libro])->first();

SELECT *
FROM `libros`
WHERE `id_libro` = '2'
SELECT *
FROM `libros`
WHERE `id_libro` = '2'
 LIMIT 1
---
    public function updateForm($id_libro)
    {
        $session = session();
        if(empty($session->get('user'))){
            return redirect()->to(base_url('admin/libros'));
        }
        helper('form');

        if($id_libro == null) {
            throw new PageNotFoundException('El id no es correcto');
        }

        $libros_model = model(LibrosModel::class);



        if($libros_model->where('id_libro',$id_libro)->find()){
            $data = [
                'libros' => $libros_model->where(['id_libro' => $id_libro])->first(),
                'title' => 'Update Book',
            ];