CodeIgniterFinal/app/Controllers/Users.php

INSERT INTO `users` (`username`, `password`, `rol`, `email`) VALUES ('user', '$2y$10$.yNVaXCDz5j41X03fXpDWe6O7eFxBUMtfksjvjtRnJyucldoaxRjG', '2', 'user@outlook.es')
---
    public function create() {
        helper('form');
        helper('password');

        $data = $this->request->getPost(['username', 'password', 'rol', 'email']);
        if (! $this->validateData($data, [
            'username' => 'required|max_length[255]|min_length[4]',
            'password' => 'required|max_length[255]|min_length[4]',
            'rol' => 'required',
            'email' => 'required',
        ])) {
            return $this->new();
        }

        $post = $this->validator->getValidated();

        $model = model(UsersModel::class);

        // PARA HASEAR LA CONTRASEÑA. FUNCIONA PORQUE ESTÁ EL HELPER('password')
        $hashedPassword = password_hash($post['password'], PASSWORD_DEFAULT);

        $model->save([
            'username' => $post['username'],
            'password' => $hashedPassword,
            'rol' => $post['rol'],
            'email' => $post['email'],
        ]);