CodeIgniterFinal/app/Controllers/Wonders.php

    public function show($location, $id_wonder) {


        //Obtener maravilla del id dado
        $wonder_model = model(WondersModel::class);
        $facts_model = model(FactsModel::class);

        $data['wonders'] = $wonder_model->findAll();

        $data['wonder_selected'] = $wonder_model->where(['id' => $id_wonder])->first();

        // Obtener los facts de la maravilla $id_wonder
        $data['wonder_facts'] = $facts_model->where(['wonder_id' => $id_wonder])->find();
---
SELECT *
FROM `facts`
WHERE `wonder_id` = '12'